---
kind: type
id: T:Autodesk.Revit.Exceptions.CheckoutElementsRequestTooLargeException
source: html/61162ab4-01c4-cf01-d307-fc45c19ad63d.htm
---
# Autodesk.Revit.Exceptions.CheckoutElementsRequestTooLargeException

Exception is thrown when too many elements are requested for checkout

## Syntax (C#)
```csharp
[SerializableAttribute]
public class CheckoutElementsRequestTooLargeException : CentralModelException
```